[
	{	"name": "Chocolate Covered Strawberry Swissroll",
		"recipeBy": "Jesse Rountree",
		"stars": 5,
		"description":"This decadent swissroll cake combines the savory sweetness of chocolate covered strawberries with the delicate flavors of a shortcake inspired rolled sponge, all packed with an amazing cream cheese frosting. Is it strawberry shortcake? Is it a chocolate covered strawberry?  Is is a swissroll cake?  The answer is, YES!",
		"note": "For Dusting, so use as much as you want, or as little as you want",
		"serving": 10,
		"temp": 375,
		"totalTime": "1 Hour",
		"prepTime": "45 Minutes",
		"cookTime": "10 - 15 Minutes",
		"image": "/img/strawberry-swissroll.jpg",
		"imageList": [
			{"imgName": "Chocolate Covered Swissroll display view", "imgUrl":"/img/strawberry-swissroll.jpg"},
			{"imgName": "Chocolate Covered Swissroll top view", "imgUrl":"/img/strawberry-swissroll-top.jpg"},
			{"imgName": "Chocolate Covered Swissroll left side view", "imgUrl":"/img/strawberry-swissroll-left.jpg"},
			{"imgName": "Chocolate Covered Swissroll right view", "imgUrl":"/img/strawberry-swissroll-right.jpg"},
			{"imgName": "Chocolate Covered Swissroll front view", "imgUrl":"/img/strawberry-swissroll-front.jpg"},
			{"imgName": "Chocolate Covered Swissroll back view", "imgUrl":"/img/strawberry-swissroll-back.jpg"}
			],
		"ingredients": [
			{"type":"Powdered Sugar", "measure": 4.5, "measureType": "Ounces","done":false},
			{"type":"Powdered Sugar", "measure": "&star;", "measureType": "&star;","done":false},
			{"type":"Granulated Sugar", "measure": 2, "measureType": "Cups","done":false},
			{"type":"Flour", "measure": 4.5, "measureType": "Ounces","done":false},
			{"type":"Eggs", "measure": 4, "measureType": "Whole","done":false},
			{"type":"Chocolate chips/chunks (your favorite kind)", "measure": 1.5, "measureType": "Cup","done":false},
			{"type":"Vegetable Oil or Shortening", "measure": 1, "measureType": "Teaspoon","done":false},
			{"type":"Fresh Strawberries", "measure": 1, "measureType": "Pint","done":false},
			{"type":"Cream Cheese", "measure": 16, "measureType": "Ounces","done":false},
			{"type":"Heavy Cream", "measure": 0.5, "measureType": "Cup","done":false},
			{"type":"Vanilla", "measure": 2, "measureType": "Teaspoon","done":false},
			{"type":"Water", "measure": 1, "measureType": "Tablespoon","done":false}		
			],
		"tools": [
			{"tool":"Kitchen Aid / Mixer", "use":"For Whipping and Mixing"},
			{"tool":"Jelly Pan / Swissroll Pan", "use":"For Baking"},
			{"tool":"Parchnip Paper", "use":"For Baking and Rolling"},
			{"tool":"Sauce Pan", "use":"For Melting Chocolate"},
			{"tool":"Flour Sifter", "use":"For Sifting Flour"},
			{"tool":"Heat Safe Glass Bowl", "use":"For Melting Chocolate"}
		],
		"directions": [
			{"header":"Step 1", "ptag":"Preheat oven to 375"},
			{"header":"Step 2", "ptag":"Butter your Swissroll pan on bottom and edges. Cut Parchnip Paper to fit inside of your Swissroll pan to cover bottom and edges."},
			{"header":"Step 3: Make your sponge", "ptag":"Seperate egg yokes from egg whites, keep yokes in one bowl and the whites in another."},
			{"header":"Step 4", "ptag":"In Kitchen Aid, whip egg whites, 1/2 of the vanilla and water. While egg whites are whipping, slowly add in the 4.5 ounces of powdered sugar.  Whip until egg whites are fluffy and makes stiff peeks. This should take a few minutes."},
			{"header":"Step 5", "ptag":"Remove egg whites from Kitchen Aid into a large bowl carefully, try to keep them as airy as possible.  Clean mixing bowl and whisk."},
			{"header":"Step 6", "ptag":"In Kitchen Aid, whisk the egg yokes and whip until fluffy."},
			{"header":"Step 7", "ptag":"Using the flour sifter, slowly sift in and fold flour into egg yokes until flour is mixed in.  Be careful not to over mix, and to keep as much air in them as possible."},
			{"header":"Step 8", "ptag":"Fold half of the yokes into the egg whites VERY carefully.  Then fold the other half in. Be very, VERY gentle in this process. Batter must remain nice and airy."},
			{"header":"Step 9", "ptag":"Gently pour batter into your Swissroll pan evenly."},
			{"header":"Step 10", "ptag":"Place into center rack of your oven and bake for 10 to 15 minutes. DO NOT OVER BAKE. Batter should be very golden and light and spring back when touched. DO NOT OVER BAKE."},
			{"header":"Step 11", "ptag":"Remove from oven and carefully flip sponge out onto another sheet of parchnip paper. Very carefully, gently roll the sponge. Cover with a damp paper towl and let cool completely."},
			{"header":"Step 12: Make your filling", "ptag":"While sponge cools, make the cream cheese filling. Clean the kitchen aid and then add in cream cheese, the rest of the vanilla, granulated sugar and about a third of the heavy cream. Whisk until you have a nice, thick, and creamy texture and the cream cheese in completely mixed in."},
			{"header":"Step 13", "ptag":"Taste your filling. Not sweet enough?  Add more sugar. To runny? Add more cream cheese or sugar. Too thick? Add more heavy cream. Filling should be on the thicker side, so be conservative with the heavy cream. If you like it, put some plastic wrap over the top of the bowl and store in fridge to set."},
			{"header":"Step 14: Prepare your strawberries", "ptag":"Wash your strawberries. Pat them dry. Remove 4 or 5, or however many you want on top, and then the rest slice into very thin slices. They need to be rolled, so slice them very thinly."},
			{"header":"Step 15", "ptag":"Roll out your sponge and spread your filling over it leaving a 1/4 of an inch from the edges."},
			{"header":"Step 16", "ptag":"Lay out your sliced strawberries in an even layer, covering the entire filling."},
			{"header":"Step 17", "ptag":"Using the parchnip paper for aid, very carefull reroll the sponge. Keep the roll tight, but allow the filling to roll with it. This takes a little finesse and patience, and the thicker the strawberries are, the harder it will be."},
			{"header":"Step 18", "ptag":"Transfer to a serving tray and wrap in plastic wrap, store in fridge to reset."},
			{"header":"Step 19: Make your chocolate", "ptag":"Fill a third of your sauce pan with water and heat on medium low heat. Place a heat safe glass bowl on top of the sauce pan and add two thirds of your chocolate chips. Still continuously until chips begin to melt, which will take a while."},
			{"header":"Step 20", "ptag":"Once chocolate is melted, take bowl off of heat. Add the rest of your chocolate chips into the chocolate and stirr until melted. This process will give your chocolate a beautiful shine."},
			{"header":"Step 21: Decorate your cake", "ptag":"Take cake out of fridge and remove plastic wrap. Dust with powdered sugar to your liking."},
			{"header":"Step 22", "ptag":"Using a spoon, drizzle melted chocolate over the top of the cake in whatever fashion you think is pretty. I whipped it back and forth, letting it whip onto the plate as well."},
			{"header":"Step 23", "ptag":"Using the strawberries you set aside, dip each one into the chocolate to coat and place directly onto the cake. The chocolate will harden and glue it to the surface."},
			{"header":"Step 24", "ptag":"Eat and enjoy! Takes lots of pictures to make your friends jealous!"}
		]
			
	} 
]